GREETING = "Привет! Эта программа помогает анализировать рынок вакансий по заданным компаниям."
PRINT_CHOICE = """
        Выберите действие:
        1. Посмотреть весь список добавленных компаний.
        2. Добавить к списку свою компанию(и).
        3. Посмотреть список всех компаний и количество вакансий у каждой компании.
        4. Посмотреть список всех вакансий с указанием названия компании, названия вакансии, зарплаты и ссылки на вакансию.
        5. Посмотреть среднюю зарплату по вакансиям.
        6. Посмотреть список всех вакансий, у которых зарплата выше средней по всем вакансиям.
        7. Поиск по ключевому слову в описании вакансий.
        8. Выход.
        """
INPUT_CHOICE = "Введите номер действия: "
LIST_EMPLOYERS = "Список добавленных компаний: {}"
ADD_EMPLOYER = "Для добавления в список, введите названия компаний(через пробел), затем нажмите Enter: "
NONE_EMPLOYER = "Данные компании(я) не найдены(а) на HeadHunter"
ERROR_ADD_EMPLOYER = "Произошла ошибка при добавлении компаний(и). Пожалуйста попробуйте еще раз."
NONE_VACANCIES = "Не найдены вакансии у данных компаний"
ERROR_ADD_VACANCIES = "Произошла ошибка при добавлении вакансий. Пожалуйста попробуйте еще раз."
ADD_SUCCESS = "Компании успешно добавлены в базу"
LIST_EMPLOYERS_OPEN_VACANCIES = "Список добавленных компаний и открытых вакансий: {}"
ALL_VACANCIES = "Список: {}"
AVG_SALARY = "Средняя зарплата по всем вакансиям: {}"
AVG_VACANCIES = "Список вакансий где зарплата выше средней: {}"
ENTER_QUERY = "Пожалуйста, введите ваш поисковый запрос: "
VACANCIES_KEYWORD = "Список вакансий где встречается запрошенное слово: {}"

GOODBYE_MESSAGE = "Всего доброго!"